boz4-master-20220602/app/views/details/_detail.html.erb

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    <strong>order:</strong>
    <%= detail.order.num_order %>