boz4-master-20220602/app/controllers/details_controller.rb

  def index
    @details = Detail.all
---
SELECT "details".* FROM "details"

  def new
    @detail = Detail.new
    @products=Product.all
    @orders=Order.all
---
SELECT "products".* FROM "products"
SELECT "orders".* FROM "orders"

  def create
    @products=Product.all
    @orders=Order.all
    @detail = Detail.new(detail_params)

    respond_to do |format|
      if @detail.save
---
SELECT "products".* FROM "products"
SELECT "orders".* FROM "orders"
INSERT INTO "details" ("quanty", "unit_price", "created_at", "updated_at", "product_id", "order_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["quanty", 10], ["unit_price", 7], ["created_at", "2022-06-01 23:21:23.633076"], ["updated_at", "2022-06-01 23:21:23.633076"], ["product_id", 1], ["order_id", 2]]

    def set_detail
      @detail = Detail.find(params[:id])
---
SELECT "details".* FROM "details" WHERE "details"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]