boz4-master-20220602/app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.all

INSERT INTO "orders" ("d_order", "score", "created_at", "updated_at", "o_send", "num_order") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["d_order", "2022-06-10"], ["score", 456], ["created_at", "2022-06-01 23:36:23.407414"], ["updated_at", "2022-06-01 23:36:23.407414"], ["o_send", ""], ["num_order", 26]]
---
  def create
    @order = Order.new(order_params)

    respond_to do |format|
      if @order.save

UPDATE "orders" SET "updated_at" = $1, "num_order" = $2 WHERE "orders"."id" = $3  [["updated_at", "2022-06-01 23:37:36.965815"], ["num_order", 26], ["id", 1]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_order
      @order = Order.find(params[:id])