boz4-master-20220602/app/controllers/products_controller.rb

  def index
    @q=Product.ransack(params[:q])
    @products=@q.result(distinct:true).page(params[:page]).per(20)
---
SELECT COUNT(DISTINCT "products"."id") FROM "products"
SELECT DISTINCT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "desciption", "price", "cost", "t_schedule", "stock", "img_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = $1 WHERE "products"."id" = $2  [["updated_at", "2022-06-02 01:29:42.332635"], ["id", 47]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 38]]