gest_biblio-libro_status/app/controllers/libros_controller.rb

  def index
      @libs = Libro.all
      @q = Libro.ransack(params[:q])
      @libros = @q.result(distinct: true).page(params[:page]).per(6)
---
SELECT COUNT(DISTINCT "libros"."id") FROM "libros"
SELECT DISTINCT "libros".* FROM "libros" LIMIT $1 OFFSET $2  [["LIMIT", 6], ["OFFSET", 0]]

  def create
      @libro = Libro.create(libro_params)
---
INSERT INTO "libros" ("title", "descrip", "author", "fechprestm", "fechdevol", "status", "created_at", "updated_at", "image_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
      respond_to do |format|
          if @libro.update(libro_params)
---
UPDATE "libros" SET "fechprestm" = $1, "status" = $2, "updated_at" = $3 WHERE "libros"."id" = $4  [["fechprestm", "2022-04-12 04:00:00"], ["status", "Prestamo"], ["updated_at", "2022-05-11 22:52:33.120192"], ["id", 2]]

  def destroy
      @libro.destroy
---
DELETE FROM "libros" WHERE "libros"."id" = $1  [["id", 25]]

  def set_libro
      @libro = Libro.find(params[:id])
---
SELECT "libros".* FROM "libros" WHERE "libros"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]