boz2/app/controllers/products_controller.rb

  def index
    @q=Product.ransack(params[:q])
    @products=@q.result(distinct:true).page(params[:page]).per(6)
---
SELECT COUNT(DISTINCT "products"."id") FROM "products"
SELECT DISTINCT "products".* FROM "products"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "desciption", "price", "cost", "t_schedule", "stock", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "t_schedule" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["t_schedule", 4], ["updated_at", "2022-05-13 14:53:50.304081"], ["id", 3]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = $1  [["id", 38]]