boz4-master/app/views/products/_product.html.erb

     </p>
    <%if product.categories.count>0%>
---
SELECT "categories".* FROM "categories" WHERE "categories"."product_id" = $1  [["product_id", 80]]
SELECT COUNT(*) FROM "categories" WHERE "categories"."product_id" = $1  [["product_id", 100]]

    <strong>Caracteristica: </strong>
      <%product.categories.each do |c|%>
---
SELECT "categories".* FROM "categories" WHERE "categories"."product_id" = $1  [["product_id", 80]]

  <%end%>
  <%if product.m_features.count>0%>
---
SELECT "m_features".* FROM "m_features" WHERE "m_features"."product_id" = $1  [["product_id", 92]]
SELECT COUNT(*) FROM "m_features" WHERE "m_features"."product_id" = $1  [["product_id", 100]]

    <strong>Caracteristica: </strong>
      <%product.m_features.each do |c|%>
---
SELECT "m_features".* FROM "m_features" WHERE "m_features"."product_id" = $1  [["product_id", 100]]