boz4-master/app/controllers/products_controller.rb

SELECT COUNT(DISTINCT "products"."id") FROM "products"
SELECT DISTINCT "products".* FROM "products"
---
  def index
    @q=Product.ransack(params[:q])
    @products=@q.result(distinct:true).page(params[:page]).per(20)

INSERT INTO "products" ("name", "desciption", "price", "cost", "t_schedule", "stock", "img_url", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "cost" = $1, "img_url" = $2, "updated_at" = $3 WHERE "products"."id" = $4  [["cost", 22], ["img_url", "Postres"], ["updated_at", "2022-05-27 03:11:07.053689"], ["id", 98]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 38]]
---
  def destroy
    @product.destroy